# n = int(input('Введите число: '))
# print((n < 0 and n) or 'Введите отрицательное число')

# n = int(input('Введите число: '))
# print((n < 20 and "Число меньше 20-ти") or "Число больше 20-ти")

# n = int(input('Введите число: '))
# print((n != 0 and "Число не равно нулю") or "Число равно нулю")

# n = int(input('Введите число: '))
# print((n % 2 == 0 and "Число четное") or "Число не четное")

# a, b, c = map(int, input("Введите значение чисел: ").split())
# print("Максимально число равно :", max(a, b, c))
